[
  {
    "number": 1,
    "arabicText": "إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ",
    "englishTranslation": "Actions are judged by intentions, and every person will have what they intended. Whoever's migration was to Allah and His Messenger, his migration is to Allah and His Messenger; and whoever's migration was for worldly gain or to marry a woman, his migration is to that for which he migrated.",
    "uzbekTranslation": "Amallar niyatlarga bog'liqdir. Har bir kishiga niyat qilgan narsasi nasib etadi. Kim hijrati Alloh va Uning Rasuli tomon bo'lsa, uning hijrati Alloh va Uning Rasuli tomondir. Kim hijrati dunyoga erishish yoki ayolga uylanish uchun bo'lsa, uning hijrati hijrat qilgan narsasi tomondir.",
    "narrator": "Umar ibn al-Khattab (radhiyallahu anhu)"
  },
  {
    "number": 2,
    "arabicText": "عَنْ عُمَرَ رَضِيَ اللهُ عَنْهُ أَيْضًا قَالَ: بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ إِذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعَرِ، لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ، حَتَّى جَلَسَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْنَدَ رُكْبَتَيْهِ إِلَى رُكْبَتَيْهِ وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ، وَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الْإِسْلَامِ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَتُقِيمَ الصَّلَاةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إِنِ اسْتَطَعْتَ إِلَيْهِ سَبِيلًا. قَالَ: صَدَقْتَ. قَالَ: فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ. قَالَ: فَأَخْبِرْنِي عَنِ الْإِيمَانِ. قَالَ: أَنْ تُؤْمِنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ. قَالَ: صَدَقْتَ. قَالَ: فَأَخْبِرْنِي عَنِ الْإِحْسَانِ. قَالَ: أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ",
    "englishTranslation": "While we were with the Messenger of Allah ﷺ one day, a man came to us whose clothes were extremely white and whose hair was extremely black; no traces of travel were seen on him and none of us knew him. He sat down in front of the Prophet ﷺ, resting his knees against his and placing his hands on his thighs, and said: 'O Muhammad, tell me about Islam.' The Messenger of Allah ﷺ said: 'Islam is to testify that there is no deity except Allah and that Muhammad is the Messenger of Allah, to establish prayer, to give zakat, to fast Ramadan, and to perform Hajj to the House if you are able.' He said: 'You have spoken the truth.' We were amazed that he asked him and then confirmed him. He said: 'Tell me about Iman.' He said: 'To believe in Allah, His angels, His books, His messengers, the Last Day, and to believe in destiny, both good and bad.' He said: 'You have spoken the truth.' He said: 'Tell me about Ihsan.' He said: 'To worship Allah as though you see Him, and if you cannot see Him, then indeed He sees you.'",
    "uzbekTranslation": "Bir kuni Rasululloh ﷺ huzurida o'tirganimizda, kiyimi nihoyat oq, sochi nihoyat qora, ustida safar asari ko'rinmaydigan va hech birimiz tanimaydigan bir kishi chiqib keldi. U Paygʻambar ﷺ oldiga o'tirdi, tizzasini tizzasiga tirab, kaftlarini sonlariga qo'yib: 'Ey Muhammad, menga Islom haqida xabar ber', dedi. Rasululloh ﷺ: 'Islom - Allohdan o'zga iloh yo'q va Muhammad Allohning elchisi deb guvohlik berish, namoz o'qish, zakot berish, Ramazon ro'zasini tutish va imkoni bo'lsa Baytullohga haj qilishdir', dedilar. U: 'To'g'ri aytdingiz', dedi. Biz uning so'rab, keyin tasdiqlashiga hayron bo'ldik. U: 'Menga iymon haqida xabar ber', dedi. Rasululloh ﷺ: 'Allohga, Uning farishtalariga, kitoblariga, payg'ambarlariga, oxirat kuniga va taqdir yaxshi-yomonligiga ishonishdir', dedilar. U: 'To'g'ri aytdingiz', dedi. U: 'Menga ehson haqida xabar ber', dedi. Rasululloh ﷺ: 'Allohni go'yo ko'rib turgandek ibodat qilishdir, agar uni ko'rmayotgan bo'lsang ham, U seni ko'rib turadi', dedilar.",
    "narrator": "Umar ibn al-Khattab (radhiyallahu anhu)"
  },
  {
    "number": 3,
    "arabicText": "بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ",
    "englishTranslation": "Islam is built upon five pillars: testifying that there is no deity except Allah and that Muhammad is the Messenger of Allah, establishing prayer, giving zakat, performing Hajj to the House, and fasting Ramadan.",
    "uzbekTranslation": "Islom besh ustun ustiga qurilgan: Allohdan o'zga iloh yo'q va Muhammad Allohning elchisi deb guvohlik berish, namoz o'qish, zakot berish, Baytullohga haj qilish va Ramazon ro'zasini tutish.",
    "narrator": "Abdullah ibn Umar (radhiyallahu anhuma)"
  },
  {
    "number": 4,
    "arabicText": "إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا نُطْفَةً، ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يُرْسَلُ إِلَيْهِ الْمَلَكُ فَيَنْفُخُ فِيهِ الرُّوحَ",
    "englishTranslation": "Verily, the creation of each one of you is brought together in his mother's womb for forty days as a drop, then he becomes a clot for a like period, then a piece of flesh for a like period, then an angel is sent to him who breathes the soul into him.",
    "uzbekTranslation": "Darhaqiqat, har biringizning yaratilishi ona qornida qirq kun tomchi holida jam bo'ladi, keyin xuddi shuncha muddat laxta qon bo'ladi, keyin xuddi shuncha muddat go'sht parchasi bo'ladi, keyin unga farishta yuboriladi va unga ruh puflaydi.",
    "narrator": "Abdullah ibn Mas'ud (radhiyallahu anhu)"
  },
  {
    "number": 5,
    "arabicText": "مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ",
    "englishTranslation": "Whoever innovates something in this matter of ours (Islam) that is not part of it, it will be rejected.",
    "uzbekTranslation": "Kim bizning bu dinimizga unga tegishli bo'lmagan narsani kiritsa, u rad etiladi.",
    "narrator": "Aisha (radhiyallahu anha)"
  },
  {
    "number": 6,
    "arabicText": "إِنَّ الْحَلَالَ بَيِّنٌ، وَإِنَّ الْحَرَامَ بَيِّنٌ، وَبَيْنَهُمَا مُشْتَبِهَاتٌ لَا يَعْلَمُهُنَّ كَثِيرٌ مِنْ النَّاسِ، فَمَنْ اتَّقَى الشُّبُهَاتِ اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ",
    "englishTranslation": "The lawful is clear and the unlawful is clear, and between them are matters unclear that many people do not know. Whoever avoids the unclear matters clears himself regarding his religion and honor.",
    "uzbekTranslation": "Halol narsa aniq, harom narsa ham aniq. Ular orasida ko'pchilik bilmaydigan shubhali narsalar bor. Kim shubhali narsalardan saqlanasa, o'z dini va obro'sini poklagan bo'ladi.",
    "narrator": "Nu'man ibn Bashir (radhiyallahu anhu)"
  },
  {
    "number": 7,
    "arabicText": "الدِّينُ النَّصِيحَةُ. قُلْنَا: لِمَنْ؟ قَالَ: لِلَّهِ، وَلِكِتَابِهِ، وَلِرَسُولِهِ، وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ",
    "englishTranslation": "Religion is sincerity. We said: To whom? He said: To Allah, His Book, His Messenger, and to the leaders of the Muslims and their common folk.",
    "uzbekTranslation": "Din nasihatdir. Biz: Kimga? dedik. U: Allohga, Uning kitobiga, Rasulga, musulmonlar rahbarlariga va ularning ommasiga, dedi.",
    "narrator": "Tamim al-Dari (radhiyallahu anhu)"
  },
  {
    "number": 8,
    "arabicText": "أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَيُقِيمُوا الصَّلَاةَ، وَيُؤْتُوا الزَّكَاةَ",
    "englishTranslation": "I have been commanded to fight the people until they testify that there is no deity except Allah and that Muhammad is the Messenger of Allah, establish prayer, and give zakat.",
    "uzbekTranslation": "Men odamlar Allohdan o'zga iloh yo'q va Muhammad Allohning elchisi deb guvohlik bermaguncha, namoz o'qimaguncha va zakot bermaguncha ular bilan kurashishga buyurildim.",
    "narrator": "Abdullah ibn Umar (radhiyallahu anhuma)"
  },
  {
    "number": 9,
    "arabicText": "مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ، وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ",
    "englishTranslation": "What I have forbidden for you, avoid it, and what I have commanded you, do as much of it as you can.",
    "uzbekTranslation": "Sizlarga qaytargan narsalarimdan qoching, buyurgan narsalarimni esa qo'lingizdan kelgancha bajaring.",
    "narrator": "Abu Hurairah (radhiyallahu anhu)"
  },
  {
    "number": 10,
    "arabicText": "إِنَّ اللَّهَ طَيِّبٌ لَا يَقْبَلُ إِلَّا طَيِّبًا",
    "englishTranslation": "Allah is pure and accepts only that which is pure.",
    "uzbekTranslation": "Albatta, Alloh pokdir va faqat pok narsanigina qabul qiladi.",
    "narrator": "Abu Hurairah (radhiyallahu anhu)"
  },
  {
    "number": 11,
    "arabicText": "دَعْ مَا يَرِيبُكَ إِلَى مَا لَا يَرِيبُكَ",
    "englishTranslation": "Leave that which makes you doubt for that which does not make you doubt.",
    "uzbekTranslation": "Sizda shubha uyg'otadigan narsani qoldirib, shubha uyg'otmaydigan narsaga yuzlaning.",
    "narrator": "Al-Hasan ibn Ali (radhiyallahu anhuma)"
  },
  {
    "number": 12,
    "arabicText": "مِنْ حُسْنِ إِسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيهِ",
    "englishTranslation": "Part of the perfection of a person's Islam is leaving that which does not concern him.",
    "uzbekTranslation": "Kishining Islomining go'zalligidan biri o'ziga tegishli bo'lmagan narsalarni tark etishidir.",
    "narrator": "Abu Hurairah (radhiyallahu anhu)"
  },
  {
    "number": 13,
    "arabicText": "لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ",
    "englishTranslation": "None of you truly believes until he loves for his brother what he loves for himself.",
    "uzbekTranslation": "Sizlardan biringiz o'zi uchun yaxshi ko'rgan narsani birodariga ham yaxshi ko'rmaguncha, haqiqiy mo'min bo'lmaydi.",
    "narrator": "Anas ibn Malik (radhiyallahu anhu)"
  },
  {
    "number": 14,
    "arabicText": "لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثَلَاثٍ: الثَّيِّبُ الزَّانِي، وَالنَّفْسُ بِالنَّفْسِ، وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ",
    "englishTranslation": "The blood of a Muslim is not lawful except for one of three things: a married person who commits adultery, a life for a life, and one who leaves his religion and abandons the community.",
    "uzbekTranslation": "Musulmon kishining qoni uch holatdan birigina halol bo'ladi: nikohli zino qiluvchi, qisosga tortiluvchi qotil va dinini tark etib, jamoatdan ajralgan kishi.",
    "narrator": "Abdullah ibn Mas'ud (radhiyallahu anhu)"
  },
  {
    "number": 15,
    "arabicText": "مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ",
    "englishTranslation": "Whoever believes in Allah and the Last Day should speak good or remain silent. Whoever believes in Allah and the Last Day should honor his neighbor. Whoever believes in Allah and the Last Day should honor his guest.",
    "uzbekTranslation": "Kim Alloh va oxirat kuniga iymon keltirgan bo'lsa, yaxshi gapirsin yoki jim tursin. Kim Alloh va oxirat kuniga iymon keltirgan bo'lsa, qo'shnisini hurmat qilsin. Kim Alloh va oxirat kuniga iymon keltirgan bo'lsa, mehmonini hurmat qilsin.",
    "narrator": "Abu Hurairah (radhiyallahu anhu)"
  },
  {
    "number": 16,
    "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَوْصِنِي. قَالَ: لَا تَغْضَبْ. فَرَدَّدَ مِرَارًا، قَالَ: لَا تَغْضَبْ",
    "englishTranslation": "A man said to the Prophet ﷺ: 'Advise me.' He said: 'Do not become angry.' The man repeated his request several times, and he said: 'Do not become angry.'",
    "uzbekTranslation": "Bir kishi Paygʻambar ﷺ ga: 'Menga nasihat qiling', dedi. U zot: 'Jahl qilma', dedilar. Kishi bir necha marta takrorladi, U zot: 'Jahl qilma', dedilar.",
    "narrator": "Abu Hurairah (radhiyallahu anhu)"
  },
  {
    "number": 17,
    "arabicText": "إِنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ، فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ",
    "englishTranslation": "Allah has prescribed excellence in all things. So if you kill, kill well; and if you slaughter, slaughter well.",
    "uzbekTranslation": "Alloh har bir narsada go'zallikni farz qilgan. Agar o'ldirmoqchi bo'lsangiz, yaxshi o'ldiring; so'ymoqchi bo'lsangiz, yaxshi so'ying.",
    "narrator": "Shaddad ibn Aus (radhiyallahu anhu)"
  },
  {
    "number": 18,
    "arabicText": "اتَّقِ اللَّهَ حَيْثُمَا كُنْتَ، وَأَتْبِعْ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا، وَخَالِقِ النَّاسَ بِخُلُقٍ حَسَنٍ",
    "englishTranslation": "Fear Allah wherever you are, follow up a bad deed with a good deed and it will erase it, and treat people with good character.",
    "uzbekTranslation": "Qayerda bo'lsang ham Allohdan qo'rq, yomon amaldan keyin yaxshi amal qil - u yomonlikni o'chiradi, odamlar bilan yaxshi muomala qil.",
    "narrator": "Abu Dharr and Mu'adh ibn Jabal (radhiyallahu anhuma)"
  },
  {
    "number": 19,
    "arabicText": "احْفَظْ اللَّهَ يَحْفَظْكَ، احْفَظْ اللَّهَ تَجِدْهُ تُجَاهَكَ، إِذَا سَأَلْتَ فَاسْأَلْ اللَّهَ، وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللَّهِ",
    "englishTranslation": "Be mindful of Allah and He will protect you. Be mindful of Allah and you will find Him before you. When you ask, ask Allah, and when you seek help, seek help from Allah.",
    "uzbekTranslation": "Allohni esda tut, U seni saqlaydi. Allohni esda tut, Uni oldingda topasan. So'rasang, Allohdan so'ra; yordam so'rasang, Allohdan yordam so'ra.",
    "narrator": "Abdullah ibn Abbas (radhiyallahu anhuma)"
  },
  {
    "number": 20,
    "arabicText": "إِنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ الْأُولَى: إِذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْتَ",
    "englishTranslation": "Among the words people obtained from the first prophecy are: If you have no shame, do as you wish.",
    "uzbekTranslation": "Odamlar avvalgi payg'ambarlik so'zlaridan olgan narsa: Agar uyalmasang, xohlaganing qil.",
    "narrator": "Abu Mas'ud (radhiyallahu anhu)"
  },
  {
    "number": 21,
    "arabicText": "قُلْتُ: يَا رَسُولَ اللَّهِ قُلْ لِي فِي الْإِسْلَامِ قَوْلًا لَا أَسْأَلُ عَنْهُ أَحَدًا غَيْرَكَ. قَالَ: قُلْ آمَنْتُ بِاللَّهِ ثُمَّ اسْتَقِمْ",
    "englishTranslation": "I said: O Messenger of Allah, tell me something about Islam which I will not ask anyone else about. He said: Say 'I believe in Allah' and then be steadfast.",
    "uzbekTranslation": "Men: Ey Allohning Rasuli, menga Islom haqida shunday gap aytingki, bu haqda sizdan boshqa hech kimdan so'ramayin, dedim. U: 'Allohga iymon keltirdim' de, so'ng to'g'ri yo'lda yur, dedi.",
    "narrator": "Sufyan ibn Abdullah (radhiyallahu anhu)"
  },
  {
    "number": 22,
    "arabicText": "أَرَأَيْتَ إِذَا صَلَّيْتُ الْمَكْتُوبَاتِ، وَصُمْتُ رَمَضَانَ، وَأَحْلَلْتُ الْحَلَالَ، وَحَرَّمْتُ الْحَرَامَ، وَلَمْ أَزِدْ عَلَى ذَلِكَ شَيْئًا، أَأَدْخُلُ الْجَنَّةَ؟ قَالَ: نَعَمْ",
    "englishTranslation": "A man asked: If I pray the prescribed prayers, fast Ramadan, treat the lawful as lawful and the unlawful as unlawful, and do nothing further, will I enter Paradise? He said: Yes.",
    "uzbekTranslation": "Bir kishi: Agar farz namozlarni o'qisam, Ramazon ro'zasini tutsam, halolni halol, haromni harom deb bilsam va bunga hech narsa qo'shmasam, jannatga kiramanmi? deb so'radi. U: Ha, dedi.",
    "narrator": "Abu Abdullah Jabir ibn Abdullah (radhiyallahu anhuma)"
  },
  {
    "number": 23,
    "arabicText": "الطُّهُورُ شَطْرُ الْإِيمَانِ، وَالْحَمْدُ لِلَّهِ تَمْلَأُ الْمِيزَانَ، وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ تَمْلَآنِ مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ",
    "englishTranslation": "Purification is half of faith. 'Alhamdulillah' fills the scales. 'SubhanAllah' and 'Alhamdulillah' fill what is between heaven and earth.",
    "uzbekTranslation": "Poklanish iymonning yarmidir. 'Alhamdulilloh' tarozuni to'ldiradi. 'SubhanAlloh' va 'Alhamdulilloh' osmon va yer orasini to'ldiradi.",
    "narrator": "Abu Malik al-Harith ibn Asim al-Ash'ari (radhiyallahu anhu)"
  },
  {
    "number": 24,
    "arabicText": "قَالَ اللَّهُ تَعَالَى: يَا عِبَادِي، إِنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا فَلَا تَظَالَمُوا",
    "englishTranslation": "Allah Almighty said: O My servants, I have forbidden injustice for Myself and have made it forbidden amongst you, so do not oppress one another.",
    "uzbekTranslation": "Alloh taolo aytdi: Ey bandalarim, Men zulmni O'zimga harom qildim va orangizdada harom qildim. Bas, bir-biringizga zulm qilmangiz.",
    "narrator": "Abu Dharr (radhiyallahu anhu)"
  },
  {
    "number": 25,
    "arabicText": "إِنَّ بِكُلِّ تَسْبِيحَةٍ صَدَقَةً، وَكُلِّ تَكْبِيرَةٍ صَدَقَةً، وَكُلِّ تَحْمِيدَةٍ صَدَقَةً، وَكُلِّ تَهْلِيلَةٍ صَدَقَةً",
    "englishTranslation": "Every glorification is charity, every declaration of Allah's greatness is charity, every praise is charity, every declaration of Allah's oneness is charity.",
    "uzbekTranslation": "Har bir tasbih sadaqadir, har bir takbir sadaqadir, har bir tahmid sadaqadir, har bir tahlil sadaqadir.",
    "narrator": "Abu Dharr (radhiyallahu anhu)"
  },
  {
    "number": 26,
    "arabicText": "كُلُّ سُلَامَى مِنْ النَّاسِ عَلَيْهِ صَدَقَةٌ كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ",
    "englishTranslation": "Every joint of a person must perform charity each day that the sun rises.",
    "uzbekTranslation": "Quyosh chiqqan har bir kunda insonning har bir bo'g'imi uchun sadaqa berish lozim.",
    "narrator": "Abu Hurairah (radhiyallahu anhu)"
  },
  {
    "number": 27,
    "arabicText": "الْبِرُّ حُسْنُ الْخُلُقِ، وَالْإِثْمُ مَا حَاكَ فِي نَفْسِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ",
    "englishTranslation": "Righteousness is good character, and sin is what wavers in your heart and you dislike that people would become aware of it.",
    "uzbekTranslation": "Yaxshilik - go'zal xulqdir, gunoh esa qalbingni bezovta qiladigan va odamlar bilishini yoqtirmaydigan narsadir.",
    "narrator": "An-Nawwas ibn Sam'an (radhiyallahu anhu)"
  },
  {
    "number": 28,
    "arabicText": "عَنْ أَبِي نَجِيحٍ الْعِرْبَاضِ بْنِ سَارِيَةَ رَضِيَ اللهُ عَنْهُ قَالَ: وَعَظَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَوْعِظَةً وَجِلَتْ مِنْهَا الْقُلُوبُ، وَذَرَفَتْ مِنْهَا الْعُيُونُ، فَقُلْنَا: يَا رَسُولَ اللَّهِ كَأَنَّهَا مَوْعِظَةُ مُوَدِّعٍ فَأَوْصِنَا. قَالَ: أُوصِيكُمْ بِتَقْوَى اللَّهِ، وَالسَّمْعِ وَالطَّاعَةِ وَإِنْ تَأَمَّرَ عَلَيْكُمْ عَبْدٌ، فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ فَسَيَرَى اخْتِلَافًا كَثِيرًا، فَعَلَيْكُمْ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الرَّاشِدِينَ الْمَهْدِيِّينَ، عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ، وَإِيَّاكُمْ وَمُحْدَثَاتِ الْأُمُورِ؛ فَإِنَّ كُلَّ بِدْعَةٍ ضَلَالَةٌ",
    "englishTranslation": "The Messenger of Allah delivered an admonition that made our hearts fearful and our eyes tearful. We said, 'O Messenger of Allah, it is as if this were a farewell sermon, so advise us.' He said, 'I enjoin you to have Taqwa (fear) of Allah and that you listen and obey, even if a slave is made a ruler over you. He among you who lives long enough will see many differences. So you must follow my Sunnah and the Sunnah of the rightly-principled and rightly-guided successors, holding fast to it with your molar teeth. Beware of newly-introduced matters, for every innovation is error and going astray.'",
    "uzbekTranslation": "Rasululloh sollallohu alayhi vasallam bizga shunday va'z qildiki, undan qalblarimiz qo'rqdi va ko'zlarimizdan yosh oqdi. Biz: Ey Allohning Rasuli, go'yo bu vidolashuv va'zi, bizga vasiyat qiling, dedik. U: Sizlarga Allohdan taqvo qilishni, hatto qul sizlarga amir bo'lsa ham, eshitish va itoat qilishni vasiyat qilaman. Sizlardan kim uzoq umr ko'rsa, ko'p ixtiloflarni ko'radi. Shuning uchun mening sunnatimga va hidoyat topgan, to'g'ri yo'ldagi xalifalarning sunnatiga rioya qiling, unga oziq tishlaringiz bilan mahkam yopishiboling. Yangi chiqarilgan ishlardan ehtiyot bo'ling, chunki har bir bid'at zalolatdir, dedi.",
    "narrator": "Abu Najih al-'Irbad ibn Sariyah (radhiyallahu anhu)"
  },
  {
    "number": 29,
    "arabicText": "قُلْتُ: يَا رَسُولَ اللَّهِ، أَخْبِرْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ وَيُبَاعِدُنِي عَنْ النَّارِ. قَالَ: لَقَدْ سَأَلْتَ عَنْ عَظِيمٍ، وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ يَسَّرَهُ اللَّهُ عَلَيْهِ",
    "englishTranslation": "I said: O Messenger of Allah, tell me of a deed that will admit me to Paradise and distance me from Hell. He said: You have asked about a great matter, yet it is easy for one whom Allah makes it easy for.",
    "uzbekTranslation": "Men: Ey Allohning Rasuli, meni jannatga kiritadigan va do'zaxdan uzoqlashtiradigan amal haqida xabar bering, dedim. U: Sen ulug' narsa haqida so'rading, lekin Alloh kimga oson qilsa, unga oson, dedi.",
    "narrator": "Mu'adh ibn Jabal (radhiyallahu anhu)"
  },
  {
    "number": 30,
    "arabicText": "إِنَّ اللَّهَ فَرَضَ فَرَائِضَ فَلَا تُضَيِّعُوهَا، وَحَدَّ حُدُودًا فَلَا تَعْتَدُوهَا، وَحَرَّمَ أَشْيَاءَ فَلَا تَنْتَهِكُوهَا",
    "englishTranslation": "Allah has ordained obligations, so do not neglect them. He has set boundaries, so do not transgress them. He has forbidden things, so do not violate them.",
    "uzbekTranslation": "Alloh farzlarni belgiladi, ularni zoya qilmangiz. Chegaralarni o'rnatdi, ulardan chiqmangiz. Narsalarni harom qildi, ularni buzmangiz.",
    "narrator": "Abu Tha'labah al-Khushani (radhiyallahu anhu)"
  },
  {
    "number": 31,
    "arabicText": "ازْهَدْ فِي الدُّنْيَا يُحِبَّكَ اللَّهُ، وَازْهَدْ فِيمَا عِنْدَ النَّاسِ يُحِبَّكَ النَّاسُ",
    "englishTranslation": "Be indifferent to the world and Allah will love you. Be indifferent to what people possess and people will love you.",
    "uzbekTranslation": "Dunyoga befarq bo'l, Alloh seni yaxshi ko'radi. Odamlar qo'lidagi narsalarga befarq bo'l, odamlar seni yaxshi ko'radilar.",
    "narrator": "Sahl ibn Sa'd (radhiyallahu anhu)"
  },
  {
    "number": 32,
    "arabicText": "لَا ضَرَرَ وَلَا ضِرَارَ",
    "englishTranslation": "There should be neither harm nor reciprocating harm.",
    "uzbekTranslation": "Zarar ham, zararli javob ham bo'lmasligi kerak.",
    "narrator": "Abu Sa'id al-Khudri (radhiyallahu anhu)"
  },
  {
    "number": 33,
    "arabicText": "لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ لَادَّعَى رِجَالٌ أَمْوَالَ قَوْمٍ وَدِمَاءَهُمْ، لَكِنَّ الْبَيِّنَةَ عَلَى الْمُدَّعِي وَالْيَمِينَ عَلَى مَنْ أَنْكَرَ",
    "englishTranslation": "If people were given according to their claims, some would claim the wealth and blood of others. But the burden of proof is on the claimant, and the oath is upon the one who denies.",
    "uzbekTranslation": "Agar odamlarga da'volariga ko'ra berilsa, ba'zilar boshqalarning mol-mulki va qonini da'vo qilardilar. Lekin dalil keltirish da'vogarning zimmasida, qasamyod esa inkor qiluvchining zimmasidadir.",
    "narrator": "Ibn Abbas (radhiyallahu anhuma)"
  },
  {
    "number": 34,
    "arabicText": "مَنْ رَأَى مِنْكُمْ مُنْكَرًا فَلْيُغَيِّرْهُ بِيَدِهِ، فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ، فَإِنْ لَمْ يَسْتَطِعْ فَبِقَلْبِهِ، وَذَلِكَ أَضْعَفُ الْإِيمَانِ",
    "englishTranslation": "Whoever among you sees an evil, let him change it with his hand; if he cannot, then with his tongue; if he cannot, then with his heart, and that is the weakest of faith.",
    "uzbekTranslation": "Kimki sizlardan yomonlikni ko'rsa, uni qo'li bilan o'zgartirsin; agar qodir bo'lmasa, tili bilan; agar qodir bo'lmasa, qalbi bilan, bu esa iymonning eng zaifidir.",
    "narrator": "Abu Sa'id al-Khudri (radhiyallahu anhu)"
  },
  {
    "number": 35,
    "arabicText": "لَا تَحَاسَدُوا، وَلَا تَنَاجَشُوا، وَلَا تَبَاغَضُوا، وَلَا تَدَابَرُوا، وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ، وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا",
    "englishTranslation": "Do not envy one another, do not artificially raise prices, do not hate one another, do not turn away from one another, do not undercut one another in trade. Be, O servants of Allah, brothers.",
    "uzbekTranslation": "Bir-biringizga hasad qilmangiz, narxlarni sun'iy ko'tarmangiz, bir-biringizni yomon ko'rmangiz, bir-biringizdan yuz o'girmangiz, savdoda bir-biringizning savdosiga aralashmangiz. Ey Allohning bandalari, birodarlar bo'lingiz.",
    "narrator": "Abu Hurairah (radhiyallahu anhu)"
  },
  {
    "number": 36,
    "arabicText": "مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ",
    "englishTranslation": "Whoever relieves a believer of distress in this world, Allah will relieve him of distress on the Day of Resurrection.",
    "uzbekTranslation": "Kim mo'minning dunyo qayg'ularidan birini yengillashsa, Alloh qiyomat kuni uning qayg'ularidan birini yengillatadi.",
    "narrator": "Abu Hurairah (radhiyallahu anhu)"
  },
  {
    "number": 37,
    "arabicText": "إِنَّ اللَّهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ ثُمَّ بَيَّنَ ذَلِكَ، فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً",
    "englishTranslation": "Allah has recorded good deeds and bad deeds. Whoever intends a good deed but does not do it, Allah records it as a complete good deed.",
    "uzbekTranslation": "Alloh yaxshilik va yomonliklarni yozdi. Kim yaxshilikka niyat qilib, uni qilmasa ham, Alloh uni to'liq yaxshilik deb yozadi.",
    "narrator": "Ibn Abbas (radhiyallahu anhuma)"
  },
  {
    "number": 38,
    "arabicText": "قَالَ اللَّهُ تَعَالَى: مَنْ عَادَى لِي وَلِيًّا فَقَدْ آذَنْتُهُ بِالْحَرْبِ",
    "englishTranslation": "Allah Almighty said: Whoever shows enmity to a friend of Mine, I have declared war upon him.",
    "uzbekTranslation": "Alloh taolo aytdi: Kim Mening do'stimga dushmanlik qilsa, Men unga urush e'lon qilaman.",
    "narrator": "Abu Hurairah (radhiyallahu anhu)"
  },
  {
    "number": 39,
    "arabicText": "إِنَّ اللَّهَ تَجَاوَزَ لِي عَنْ أُمَّتِي الْخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ",
    "englishTranslation": "Allah has pardoned my nation for mistakes, forgetfulness, and what they are forced to do.",
    "uzbekTranslation": "Alloh mening ummatimning xatolarini, unutishlarini va majbur qilingan ishlarini kechirdi.",
    "narrator": "Ibn Abbas (radhiyallahu anhuma)"
  },
  {
    "number": 40,
    "arabicText": "كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيبٌ أَوْ عَابِرُ سَبِيلٍ",
    "englishTranslation": "Be in this world as if you were a stranger or a traveler.",
    "uzbekTranslation": "Dunyoda begona yoki yo'lovchi kabi bo'l.",
    "narrator": "Abdullah ibn Umar (radhiyallahu anhuma)"
  },
  {
    "number": 41,
    "arabicText": "لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَوَاهُ تَبَعًا لِمَا جِئْتُ بِهِ",
    "englishTranslation": "None of you truly believes until his desires follow what I have brought.",
    "uzbekTranslation": "Sizlardan biringiz nafs-havasi men keltirgan narsaga ergashmaguncha, haqiqiy mo'min bo'lmaydi.",
    "narrator": "Abu Muhammad Abdullah ibn Amr (radhiyallahu anhuma)"
  },
  {
    "number": 42,
    "arabicText": "قَالَ اللَّهُ تَعَالَى: يَا ابْنَ آدَمَ، إِنَّكَ مَا دَعَوْتَنِي وَرَجَوْتَنِي غَفَرْتُ لَكَ عَلَى مَا كَانَ مِنْكَ وَلَا أُبَالِي",
    "englishTranslation": "Allah Almighty said: O son of Adam, as long as you call upon Me and hope in Me, I will forgive you for what you have done, and I do not mind.",
    "uzbekTranslation": "Alloh taolo aytdi: Ey odam bolasi, sen Menga iltijo qilib, umid qilgan ekansan, qilgan ishlaringni kechiraman va bunga parvo qilmayman.",
    "narrator": "Anas ibn Malik (radhiyallahu anhu)"
  }
]
